////////////////////////////////////////////////////////////////////////////////
// MIT License  Copyright (c) 2025 Mikhail Nastaskov
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НепроверяемыеРеквизиты.Добавить("ИсполняемыйКод");
	Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ТекущаяЗапись.ПрименитьСобственноеПравило 
			И Не ЗначениеЗаполнено(ТекущаяЗапись.ИсполняемыйКод) Тогда
			
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'При применении собственного правила исполняемый код должен быть заполнен'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

