
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.УзелПланаОбмена) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан узел плана обмена.'"), , , , Отказ);
		
	КонецЕсли;
	
	УзелПланаОбмена = Параметры.УзелПланаОбмена;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "УзелИнформационнойБазы", УзелПланаОбмена, ВидСравненияКомпоновкиДанных.Равно);
	
	ЗаполнитьНастройкиУзла();
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПереопределениеРегистрацииПриИзменении(Элемент)
	
	ОбновитьНастройкиУзла();
	Если ИспользоватьПереопределениеРегистрации Тогда
		ОбновитьПереопределяемыеПравилаНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОбновитьПравила(Команда)
	
	ОбновитьПереопределяемыеПравилаНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьАктивным(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ИзменитьОтметкиПравилФильтрации(ВыделенныеСтроки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьНеактивным(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ИзменитьОтметкиПравилФильтрации(ВыделенныеСтроки, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПереопределяемыеПравилаНаСервере()
	
	ПРО_УправлениеПравиламиРегистрации.ЗаполнитьПравилаРегистрацииОбъектов(УзелПланаОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтметкиПравилФильтрации(ВыделенныеСтроки, ЗначениеОтметки)
	
	КлючиЗаписей = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		КлючЗаписи = Новый Структура("УзелИнформационнойБазы,ОбъектРегистрации",
			ВыделеннаяСтрока.УзелИнформационнойБазы,
			ВыделеннаяСтрока.ОбъектРегистрации);
		КлючиЗаписей.Добавить(КлючЗаписи);
	КонецЦикла;
	
	ПРО_УправлениеПравиламиРегистрации.ОбновитьРазрешенияРегистрацииПоКлючам(КлючиЗаписей, ЗначениеОтметки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиУзла()
	
	НастройкиУзла = ПРО_УправлениеПравиламиРегистрации.ПолучитьНастройкиУзлаРегистрации(УзелПланаОбмена);
	ИспользоватьПереопределениеРегистрации = НастройкиУзла.ИспользоватьПереопределениеРегистрации;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиУзла()
	
	НастройкиУзла = ПРО_УправлениеПравиламиРегистрации.НовыеНастройкиУзла();
	НастройкиУзла.ИспользоватьПереопределениеРегистрации = ИспользоватьПереопределениеРегистрации;
	
	ПРО_УправлениеПравиламиРегистрации.ОбновитьНастройкиУзлаРегистрации(УзелПланаОбмена, НастройкиУзла);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.Список.Видимость = ИспользоватьПереопределениеРегистрации;
	
КонецПроцедуры

#КонецОбласти