
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.СброситьКэшПравилРегистрации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименитьСобственноеПравилоПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПравило(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеРедактораКонсолиКода", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПРО_ИсходныйИсполняемыйКод", Запись.ИсполняемыйКод);
	ПараметрыФормы.Вставить("ПРО_ОбъектРегистрации", Запись.ОбъектРегистрации);
	
	ОткрытьФорму("Обработка.ПРО_УправлениеРегистрациейДанныхКонсольКода.Форма", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор, , ,
		Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.НастроитьПравило.Видимость = Запись.ПрименитьСобственноеПравило;
	
	УстановитьЗаголовокНастройкиПравил();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокНастройкиПравил()
	
	Если Запись.ПрименитьСобственноеПравило И Не ЗначениеЗаполнено(Запись.ИсполняемыйКод) Тогда
		Элементы.НастроитьПравило.Заголовок = "<правило не заполнено, заполнить>";
		Элементы.НастроитьПравило.ЦветТекста = ЦветаСтиля.ЦветТекстаПроблема;
	Иначе
		Элементы.НастроитьПравило.Заголовок = "Настроить правило";
		Элементы.НастроитьПравило.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактораКонсолиКода(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Результат.Модифицирован Тогда
			Запись.ИсполняемыйКод = Результат.ВыполняемыйКод;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокНастройкиПравил();
	
КонецПроцедуры

#КонецОбласти
