////////////////////////////////////////////////////////////////////////////////
// MIT License  Copyright (c) 2025 Mikhail Nastaskov
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройки узла информационной базы для регистрации данных.
//
// Параметры:
//  Узел - ОпределяемыйТип.ПРО_УзелПланаОбмена - Узел информационной базы.
//
// Возвращаемое значение:
//  Структура - См. ПРО_УправлениеПравиламиРегистрации.НовыеНастройкиУзла.
//
Функция ПолучитьНастройки(Узел) Экспорт

	Результат = Новый Структура("ИспользоватьПереопределениеРегистрации", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ПРО_НастройкиУзловРегистрации КАК НастройкиУзловРегистрации
	|ГДЕ
	|	НастройкиУзловРегистрации.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЦикла;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Добавляет настройки регистрации в указанный узел информационной базы.
// 
// Параметры:
//  Узел - ОпределяемыйТип.ПРО_УзелПланаОбмена - Узел информационной базы.
//  Настройки - Структура - Настройки узла. См. ПРО_УправлениеПравиламиРегистрации.НовыеНастройкиУзла.
//
Процедура ПереопределитьНастройкиУзла(Узел, Настройки) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.УзелИнформационнойБазы = Узел;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.УзелИнформационнойБазы = Узел;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Настройки);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры


#КонецОбласти

#КонецЕсли