#Область СлужебныйПрограммныйИнтерфейс

&После("ЗарегистрироватьИзмененияДанных")
Процедура ПРО_ПослеЗарегистрироватьИзмененияДанных(Знач Получатель, Знач Данные,
	Знач ПроверятьРазрешениеВыгрузки = Истина)
	
	ПРО_УправлениеПравиламиРегистрации.ВыполнитьДополнительнуюРегистрациюПриРучнойРегистрации(Получатель, Данные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Перед("ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение")
Процедура ПРО_ПередВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение(МассивУзловРезультат, Объект, ИмяПланаОбмена, ДополнительныеПараметры)
	
	ПРО_УправлениеПравиламиРегистрацииСлужебный.ПроверитьКэшМеханизмаРегистрации();
	
КонецПроцедуры

&После("ВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение")
Процедура ПРО_ПослеВыполнитьПравилаРегистрацииОбъектовДляПланаОбменаПопыткаИсключение(МассивУзловРезультат, Объект, ИмяПланаОбмена, ДополнительныеПараметры)
	
	ПРО_УправлениеПравиламиРегистрации.ВыполнитьПереопределяемыеПравилаРегистрацииДляПланаОбменаПослеПРО(
		Объект, МассивУзловРезультат, ИмяПланаОбмена, ДополнительныеПараметры
	);
	
КонецПроцедуры

&Перед("ЗарегистрироватьИзменениеОбъекта")
Процедура ПРО_ПередЗарегистрироватьИзменениеОбъекта(ИмяПланаОбмена, Объект, Отказ,
	ДополнительныеПараметры = Неопределено)
	
	ПРО_УправлениеПравиламиРегистрации.НачатьОтложеннуюДополнительнуюРегистрацию(Объект);
	
КонецПроцедуры

&После("ЗарегистрироватьИзменениеОбъекта")
Процедура ПРО_ПослеЗарегистрироватьИзменениеОбъекта(ИмяПланаОбмена, Объект, Отказ,
	ДополнительныеПараметры = Неопределено)
	
	ПРО_УправлениеПравиламиРегистрации.ВыполнитьОтложеннуюДополнительнуюРегистрацию(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти